#+begin_src elisp :noweb yes
  (message "Loading emacs config ...")
  <<ORG_CAPTURE>>
  (message "Finished loading emacs config .")
#+end_src

#+RESULTS:
: Fichier C

* Task bar stuff
#+begin_src elisp :tangle no :noweb-ref ORG_CAPTURE
  (message "Task bar stuff ...")
  (defface face-for-display-time
    '((((type x w32 mac))
       ;; #060525 is the background colour of my default face.
       (:foreground "#b58900" :inherit bold))
      (((type tty))
       (:foreground "blue")))
    "Face used to display the time in the mode line.")

  ;; (setq display-time-format "%Y-%M-%d %T:%M:%S")

  ;; (setq display-time-string-forms
  ;; 	 '((propertize (concat " " 24-hours ":" minutes " ")
  ;; 		      'face 'face-for-display-time)))
  (setq display-time-string-forms '((propertize (format-time-string "%Y-%M-%d %T" now) 'face 'face-for-display-time)))

  (display-time-mode)
  (display-battery-mode)

  #+end_src

#+RESULTS:
| propertize | (format-time-string %Y-%M-%d %T:%M:%S now) | 'face | 'face-for-display-time |

#+RESULT:S
: %Y-%M-%d %T:%M:%S




* Workspaces thingy
#+begin_src elisp 

  ;;   (easy-menu-define exwm-workspace-menu nil
  ;;     "Menu for Exwm Workspace.

  ;;   Also used in `exwm-mode-line-workspace-map'."
  ;;     '("Exwm Workspace"
  ;;       ["Add workspace" exwm-workspace-add]
  ;;       ["Delete current workspace" exwm-workspace-delete]
  ;;       ["Move workspace to" exwm-workspace-move]
  ;;       ["Swap workspaces" exwm-workspace-swap]
  ;;       ["Move X window to" exwm-workspace-move-window]
  ;;       ["Move X window from" exwm-workspace-switch-to-buffer]
  ;;       ["Toggle minibuffer" exwm-workspace-toggle-minibuffer]
  ;;       ["Switch workspace" exwm-workspace-switch]
  ;;       ;; Place this entry at bottom to avoid selecting others by accident.
  ;;       ("Switch to" :filter
  ;;        (lambda (&rest _args)
  ;; 	 (mapcar (lambda (i)
  ;; 		   `[,(format "workspace %d" i)
  ;; 		     (lambda ()
  ;; 		       (interactive)
  ;; 		       (exwm-workspace-switch ,i))
  ;; 		     (/= ,i exwm-workspace-current-index)])
  ;; 		 (number-sequence 0 (1- (exwm-workspace--count))))))))

  ;;   (defvar exwm-mode-line-workspace-map
  ;;     (let ((map (make-sparse-keymap)))
  ;;       (define-key map [mode-line mouse-1] 'exwm-workspace-switch)
  ;;       (define-key map [mode-line mouse-3] exwm-workspace-menu)
  ;;       map)
  ;;     "Local keymap for EXWM mode line string.  See `exwm-mode-line-format'.")


  ;;   (defcustom exwm-mode-line-format
  ;;   `("["
  ;;     (:propertize (:eval (elt exwm-workspace--switch-history exwm-workspace-current-index))
  ;; 		 local-map ,exwm-mode-line-workspace-map
  ;; 		 face bold
  ;; 		 mouse-face mode-line-highlight
  ;; 		 help-echo "mouse-1: Switch to / add / delete to EXWM workspaces.
  ;; mouse-2: EXWM Workspace menu.
  ;; ")
  ;;     "]")
  ;;   "EXWM workspace in the mode line."
  ;;   :type 'sexp)


  ;;   ;; FIXME: Don't push the value.  Instead push a symbol.  If done, (1)
  ;;   ;; this will avoid duplicate entries for EXWM workspace (2) The mode
  ;;   ;; line string will change in sync with the value of
  ;;   ;; `exwm-mode-line-format'.
  ;;   (add-to-list 'mode-line-misc-info exwm-mode-line-format t) 
#+end_src

#+RESULTS:
| global-mode-string | ( global-mode-string)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
| [                  | (:propertize (:eval (elt exwm-workspace--switch-history exwm-workspace-current-index)) local-map (keymap (mode-line keymap (mouse-3 keymap Exwm Workspace (Add workspace menu-item Add workspace exwm-workspace-add) (Delete current workspace menu-item Delete current workspace exwm-workspace-delete) (Move workspace to menu-item Move workspace to exwm-workspace-move) (Swap workspaces menu-item Swap workspaces exwm-workspace-swap) (Move X window to menu-item Move X window to exwm-workspace-move-window) (Move X window from menu-item Move X window from exwm-workspace-switch-to-buffer) (Toggle minibuffer menu-item Toggle minibuffer exwm-workspace-toggle-minibuffer) (Switch workspace menu-item Switch workspace exwm-workspace-switch) (Switch to menu-item Switch to nil :filter #[257 \302\300!\301"\207 [(lambda (&rest _args) (mapcar (lambda (i) `[,(format workspace %d i) (lambda nil (interactive) (exwm-workspace-switch ,i)) (/= ,i exwm-workspace-current-index)]) (number-sequence 0 (1- (exwm-workspace--count))))) Switch to easy-menu-filter-return] 4 |









#+begin_src emacs-lisp

    ;    (elt exwm-workspace--switch-history exwm-workspace-current-index)

  ;;    exwm-mode-line-format



  ;;   ("[" (:propertize (:eval (elt exwm-workspace--switch-history exwm-workspace-current-index)) local-map (keymap (mode-line keymap ... ...)) face bold mouse-face mode-line-highlight help-echo "mouse-1: Switch to / add / delete to EXWM workspaces.
  ;; mouse-2: EXWM Workspace menu.
  ;; ") "]")

#+end_src

#+RESULTS:
* Latex stuff


#+begin_src elisp :tangle no :noweb-ref ORG_CAPTURE
(setq org-latex-pdf-process
'("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
"biber %b"
"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
#+end_src

  #+RESULTS:
  | pdflatex -interaction nonstopmode -output-directory %o %f | biber %b | pdflatex -interaction nonstopmode -output-directory %o %f | pdflatex -interaction nonstopmode -output-directory %o %f |
